[
  {
    "clasificacion": "Ultrasound Transducers",
    "grupo": "2-14",
    "tipo_pregunta": "opcion_multiple",
    "enunciado": "In typical transducers, how is the slice-thickness plane focused?",
    "image": "",
    "opciones": [
      "Using a lens",
      "By the transducer's physical shape",
      "Electronically",
      "Through acoustic matching"
    ],
    "respuesta_correcta": [
      "Using a lens"
    ],
    "concept_to_study": "Transducer Focusing (Elevational Plane)",
    "explicacion_openai": "Traditionally, single-row array transducers rely on a mechanical acoustic lens to focus the slice-thickness (elevational) plane. This lens narrows the beam out of plane, improving image resolution in that dimension. In newer 1.5D (multi-row) designs, additional rows of elements can electronically adjust the elevational focus. Understanding both methods helps sonographers select the right transducer and achieve optimal elevational resolution for clear, detailed images."
  },
  {
    "clasificacion": "Physical Principles",
    "grupo": "4-16",
    "tipo_pregunta": "opcion_multiple",
    "enunciado": "When sound travels through a significant amount of water before hitting a reflector, the reflector appears:",
    "image": "",
    "opciones": [
      "Closer than actual",
      "Fainter than actual",
      "Harder than actual",
      "Too far away"
    ],
    "respuesta_correcta": [
      "Too far away"
    ],
    "concept_to_study": "Speed Displacement Artifact",
    "explicacion_openai": "Diagnostic ultrasound systems assume a constant speed of sound of 1540 m/s. In reality, the speed of sound in water is approximately 1480 m/s and is slower, so the wave's round-trip travel time is longer than the machine expects. Since the system still uses 1540 m/s × time / 2 to calculate depth, it interprets the extra travel time as if the reflector were located farther away. This results in a display error called speed displacement artifact, where the reflector appears deeper than its true position. Recognizing this phenomenon is vital for understanding and correctly interpreting artifacts in ultrasound imaging."
  },
  {
    "clasificacion": "Clinical Safety, Patient Care, and Quality Assurance",
    "grupo": "6-3",
    "tipo_pregunta": "opcion_multiple",
    "enunciado": "What is the maximum permissible temperature rise to avoid thermally induced biological effects?",
    "image": "",
    "opciones": [
      "1°C",
      "3°C",
      "5°C",
      "2°C"
    ],
    "respuesta_correcta": [
      "2°C"
    ],
    "concept_to_study": "Thermal Bioeffects",
    "explicacion_openai": "To minimize the risk of thermally induced biological effects, the maximum permissible temperature rise in tissue during diagnostic ultrasound is 2°C. This limit is based on guidelines from organizations like the AIUM. Familiarity with these guidelines is vital for ensuring patient safety during ultrasound examinations."
  },
  {
    "clasificacion": "Physical Principles",
    "grupo": "7-20",
    "tipo_pregunta": "opcion_multiple",
    "enunciado": "If two sound beams with different frequencies travel through soft tissue, which travels faster?",
    "image": "",
    "opciones": [
      "Lower frequency beam",
      "Higher frequency beam",
      "Both will travel at the same speed",
      "It depends on attenuation"
    ],
    "respuesta_correcta": [
      "Both will travel at the same speed"
    ],
    "concept_to_study": "Speed of Sound in Soft Tissue",
    "explicacion_openai": "The speed of sound in soft tissue is considered constant (approximately 1540 m/s) and is independent of the frequency of the sound beam. Different frequencies will attenuate differently, but their speed remains the same. This principle is fundamental in understanding how ultrasound images are formed and interpreted.However, factors like tissue density and stiffness do affect the speed of sound. Increased density typically slows down the sound slightly, whereas greater stiffness (or elasticity) increases the speed. These variations are generally minor in soft tissues, allowing for the assumption of a constant speed of sound in most clinical scenarios."
  },
  {
    "clasificacion": "Doppler Imaging Concepts",
    "grupo": "1-2",
    "tipo_pregunta": "opcion_multiple",
    "enunciado": "While performing a carotid artery exam, you detect aliasing in the spectral Doppler waveform. If increasing the PRF does not resolve the aliasing, what is the NEXT best action?",
    "image": "aliasing.jpg",
    "opciones": [
      "Decrease the sample depth",
      "Increase the Doppler angle",
      "Use a continuous wave transducer",
      "Decrease the frequency"
    ],
    "respuesta_correcta": [
      "Decrease the sample depth"
    ],
    "concept_to_study": "Nyquist Limit",
    "explicacion_openai": "The Nyquist Limit is the maximum Doppler shift that can be accurately measured (PRF/2). Shallower sample volumes allow for higher PRFs because the system listens for a shorter time, thus increasing the Nyquist limit. This knowledge helps in optimizing Doppler settings to avoid aliasing."
  },
  {
    "clasificacion": "Imaging Principles and Instrumentation",
    "grupo": "9-7",
    "tipo_pregunta": "opcion_multiple",
    "enunciado": "A display limited to only black and white without shades of gray is known as:",
    "image": "",
    "opciones": [
      "Grayscale",
      "Color scale",
      "Bistable",
      "Multistable"
    ],
    "respuesta_correcta": [
      "Bistable"
    ],
    "concept_to_study": "Bistable Display",
    "explicacion_openai": "A bistable display is one that is limited to only two shades: black and white. There are no intermediate shades of gray. This type of display has high contrast but poor dynamic range. Recognizing display types is crucial for interpreting ultrasound images accurately."
  },
  {
    "clasificacion": "Clinical Safety, Patient Care, and Quality Assurance",
    "grupo": "12-6",
    "tipo_pregunta": "opcion_multiple",
    "enunciado": "What is the term for the smallest unit of digital storage?",
    "image": "",
    "opciones": [
      "The bit",
      "The byte",
      "The nibble",
      "The word"
    ],
    "respuesta_correcta": [
      "The bit"
    ],
    "concept_to_study": "Bit (Binary Digit)",
    "explicacion_openai": "A bit is the smallest unit of digital storage, representing a single binary value (0 or 1). All digital information is ultimately stored as combinations of bits. Understanding digital storage is essential for managing and interpreting ultrasound data."
  },
  {
    "clasificacion": "Physical Principles",
    "grupo": "4-17",
    "tipo_pregunta": "opcion_multiple",
    "enunciado": "In the Fresnel zone:",
    "image": "",
    "opciones": [
      "The beam area decreases with distance from the transducer",
      "The beam area increases with distance",
      "The beam remains collimated",
      "The attenuation is minimal"
    ],
    "respuesta_correcta": [
      "The beam area decreases with distance from the transducer"
    ],
    "concept_to_study": "Fresnel Zone (Near Zone)",
    "explicacion_openai": "The Fresnel zone, or near zone, is the region closest to the transducer where the ultrasound beam converges. Within this zone, the beam area decreases with increasing distance from the transducer. This knowledge is important for optimizing image resolution and focus."
  },
  {
    "clasificacion": "Ultrasound Transducers",
    "grupo": "2-15",
    "tipo_pregunta": "opcion_multiple",
    "enunciado": "Initially, the information sent to the scan converter from the receiver is in what format?",
    "image": "",
    "opciones": [
      "Digital",
      "Analog",
      "Binary",
      "Pulsed"
    ],
    "respuesta_correcta": [
      "Analog"
    ],
    "concept_to_study": "Analog vs. Digital Signals",
    "explicacion_openai": "The signals returning from the body and received by the transducer are initially in analog format. The scan converter then performs analog-to-digital conversion (ADC) to process and display the image. This conversion is crucial for interpreting ultrasound images accurately."
  },
  {
    "clasificacion": "Doppler Imaging Concepts",
    "grupo": "3-5",
    "tipo_pregunta": "opcion_multiple",
    "enunciado": "Which statement about color Doppler is accurate?",
    "image": "",
    "opciones": [
      "It displays only upflow",
      "Each pixel can either be grayscale or color",
      "It has no color hues",
      "It shows flow direction with depth only"
    ],
    "respuesta_correcta": [
      "Each pixel can either be grayscale or color"
    ],
    "concept_to_study": "Color Doppler Display",
    "explicacion_openai": "In color Doppler imaging, each pixel on the display can represent either grayscale information (structural data) or color information (velocity data). The color overlay indicates the presence, direction, and velocity of blood flow. This understanding aids in accurately assessing blood flow characteristics."
  },
  {
    "clasificacion": "Imaging Principles and Instrumentation",
    "grupo": "9-8",
    "tipo_pregunta": "opcion_multiple",
    "enunciado": "Which method maintains pixel density when enlarging an image?",
    "image": "",
    "opciones": [
      "Linear magnification",
      "Nearest neighbor scaling",
      "Area magnification",
      "Write magnification"
    ],
    "respuesta_correcta": [
      "Write magnification"
    ],
    "concept_to_study": "Write Magnification (Write Zoom)",
    "explicacion_openai": "Write magnification, also known as regional expansion selection (RES), is a pre-processing zoom technique. It rescans only the region of interest, maintaining pixel density and improving image resolution. This technique is essential for enhancing image quality in specific areas of interest."
  },
  {
    "clasificacion": "Physical Principles",
    "grupo": "1-18",
    "tipo_pregunta": "opcion_multiple",
    "enunciado": "How are amplitude and frequency related?",
    "image": "",
    "opciones": [
      "Direct",
      "Inverse",
      "No relation",
      "Quadratic"
    ],
    "respuesta_correcta": [
      "No relation"
    ],
    "concept_to_study": "Amplitude and Frequency Relationship",
    "explicacion_openai": "Amplitude and frequency are independent characteristics of a sound wave. Amplitude relates to the strength of the wave, while frequency relates to the number of cycles per second. Grasping these properties is fundamental for interpreting ultrasound waveforms and their effects on imaging."
  },
  {
    "clasificacion": "Physical Principles",
    "grupo": "1-19",
    "tipo_pregunta": "opcion_multiple",
    "enunciado": "What is the relationship between spatial pulse length and pulse duration?",
    "image": "",
    "opciones": [
      "They are inversely related",
      "Directly related",
      "Not related",
      "Dependent on frequency"
    ],
    "respuesta_correcta": [
      "Directly related"
    ],
    "concept_to_study": "Spatial Pulse Length and Pulse Duration Relationship",
    "explicacion_openai": "Spatial pulse length (SPL) and pulse duration (PD) are directly related. A longer pulse duration results in a longer spatial pulse length, and vice versa. Both affect axial resolution. Recognizing this relationship is crucial for optimizing image quality and resolution."
  },
  {
    "clasificacion": "Physical Principles",
    "grupo": "7-21",
    "tipo_pregunta": "opcion_multiple",
    "enunciado": "Which statement about axial resolution is true?",
    "image": "",
    "opciones": [
      "It varies with depth",
      "It is always worse than lateral resolution",
      "It does not vary with depth",
      "It depends only on frequency"
    ],
    "respuesta_correcta": [
      "It does not vary with depth"
    ],
    "concept_to_study": "Axial Resolution",
    "explicacion_openai": "Axial resolution, also known as longitudinal, depth, or range resolution, is determined by the spatial pulse length. This resolution remains constant regardless of image depth and is crucial for distinguishing between structures that are close together along the direction of the sound beam.Frequency plays a key role in axial resolution. Higher frequencies produce shorter wavelengths, resulting in shorter pulses and improved axial resolution. This allows for better differentiation between closely spaced structures. However, higher frequencies also have less penetration, so there's a trade-off between resolution and imaging depth. Understanding these factors helps in optimizing image quality for accurate clinical assessments."
  },
  {
    "clasificacion": "Doppler Imaging Concepts",
    "grupo": "10-3",
    "tipo_pregunta": "opcion_multiple",
    "enunciado": "How does increasing the pressure differential across a vessel affect blood flow?",
    "image": "",
    "opciones": [
      "Resistance decreases",
      "Flow rate increases",
      "Viscosity increases",
      "Flow rate decreases"
    ],
    "respuesta_correcta": [
      "Flow rate increases"
    ],
    "concept_to_study": "Pressure Differential and Flow Rate",
    "explicacion_openai": "Increasing the pressure differential (pressure difference) across a vessel, while keeping other factors constant, will increase the flow rate. This is described by Poiseuille's Law, a fundamental principle of fluid dynamics. This relationship is crucial for interpreting Doppler flow measurements."
  },
  {
    "clasificacion": "Doppler Imaging Concepts",
    "grupo": "10-4",
    "tipo_pregunta": "opcion_multiple",
    "enunciado": "Which law relates flow to pressure differential, viscosity, and length?",
    "image": "",
    "opciones": [
      "Newton's law",
      "Poiseuille's law",
      "Bernoulli's principle",
      "Snell's law"
    ],
    "respuesta_correcta": [
      "Poiseuille's law"
    ],
    "concept_to_study": "Poiseuille's Law",
    "explicacion_openai": "Poiseuille's law helps us understand how blood flows through vessels by considering three key variables: 1:pressure difference, 2:vessel size (radius), and 3: vessel length. The flow rate depends on these factors, along with the viscosity of the blood.A higher pressure difference increases blood flow, similar to how squeezing a tube of toothpaste harder makes more come out. A larger vessel size (radius) greatly boosts flow, like a wider garden hose allows more water through. Conversely, longer vessels decrease flow, much like a longer straw makes it harder to sip a drink.In clinical settings, understanding these factors is crucial. For example, if blood vessels narrow due to plaque buildup, it reduces flow and increases pressure, leading to conditions like hypertension. In ultrasound, recognizing changes in flow helps identify issues like blockages or abnormal vessel conditions, guiding treatment and ensuring effective patient care."
  },
  {
    "clasificacion": "Doppler Imaging Concepts",
    "grupo": "10-5",
    "tipo_pregunta": "opcion_multiple",
    "enunciado": "What is the most common type of flow in the body?",
    "image": "",
    "opciones": [
      "Turbulent",
      "Transitional",
      "Laminar",
      "Vortex"
    ],
    "respuesta_correcta": [
      "Laminar"
    ],
    "concept_to_study": "Laminar Flow",
    "explicacion_openai": "Laminar flow is the most common type of blood flow found in the normal circulatory system. It is characterized by smooth, orderly layers of fluid movement, with the highest velocity in the center of the vessel and lower velocities near the vessel walls. Recognizing laminar flow is crucial for interpreting normal and pathological flow patterns."
  },
  {
    "clasificacion": "Ultrasound Transducers",
    "grupo": "5-78",
    "tipo_pregunta": "opcion_multiple",
    "enunciado": "Which type of transducer is most suitable for imaging deep structures in the abdomen?",
    "image": "",
    "opciones": [
      "Endocavitary transducer",
      "Linear sequenced array transducer",
      "Convex transducer",
      "Continuous-wave transducer"
    ],
    "respuesta_correcta": [
      "Convex transducer"
    ],
    "concept_to_study": "Convex (Curved) Transducers",
    "explicacion_openai": "Convex transducers, also known as curved array transducers, are well-suited for imaging deep structures in the abdomen. Their curved shape provides a wider field of view at depth, and they typically operate at lower frequencies, allowing for greater penetration. Selecting the appropriate transducer is essential for specific imaging needs."
  },
  {
    "clasificacion": "Clinical Safety, Patient Care, and Quality Assurance",
    "grupo": "3-66",
    "tipo_pregunta": "opcion_multiple",
    "enunciado": "Sonographers best practice while scanning is to avoid abducting the arm more than how many degrees?",
    "image": "",
    "opciones": [
      "50",
      "90",
      "30",
      "40"
    ],
    "respuesta_correcta": [
      "30"
    ],
    "concept_to_study": "Sonographer Ergonomics",
    "explicacion_openai": "To prevent musculoskeletal injuries, sonographers should avoid abducting (raising) their arm more than 30 degrees from their body while scanning. Proper ergonomics are crucial for long-term health and career longevity. Adhering to ergonomic principles is essential for maintaining a healthy work environment."
  },
  {
    "clasificacion": "Clinical Safety, Patient Care, and Quality Assurance",
    "grupo": "4-34",
    "tipo_pregunta": "opcion_multiple",
    "enunciado": "Which action demonstrates best practice during ultrasound exams regarding the ALARA principle?",
    "image": "",
    "opciones": [
      "The exposure time should be extended during the exam.",
      "Use the lowest possible output power that provides a diagnostic image.",
      "Use the lowest possible gain.",
      "Ensure that the time gain compensation (TGC) is within acceptable limits."
    ],
    "respuesta_correcta": [
      "Use the lowest possible output power that provides a diagnostic image."
    ],
    "concept_to_study": "ALARA Principle",
    "explicacion_openai": "ALARA stands for \"As Low As Reasonably Achievable.\" In ultrasound, this means using the lowest possible output power and shortest scan time necessary to obtain a diagnostic image, minimizing potential bioeffects. Applying the ALARA principle is crucial for ensuring patient safety during ultrasound examinations."
  },
  {
    "clasificacion": "Clinical Safety, Patient Care, and Quality Assurance",
    "grupo": "5-45",
    "tipo_pregunta": "opcion_multiple",
    "enunciado": "This type of cavitation is the MOST concerning cause of bioeffects:",
    "image": "",
    "opciones": [
      "Transient",
      "Absorption",
      "Stable",
      "Thermal"
    ],
    "respuesta_correcta": [
      "Transient"
    ],
    "concept_to_study": "Transient Cavitation",
    "explicacion_openai": "Transient cavitation, also known as inertial cavitation, involves the rapid expansion and violent collapse of microbubbles. This collapse generates high temperatures and pressures, potentially causing tissue damage. It is more concerning than stable cavitation. Recognizing cavitation is essential for assessing potential bioeffects in ultrasound imaging."
  },
    {
    "clasificacion": "Imaging Principles and Instrumentation",
    "grupo": "8-1",
    "tipo_pregunta": "opcion_multiple",
    "enunciado": "A sonographer is performing an abdominal ultrasound examination. The image appears excessively bright, with a loss of detail in some areas and saturation of the echoes. Which of the following adjustments is MOST likely set too high?",
    "image": "",
    "opciones": [
      "Output Power",
      "Time Gain Compensation (TGC)",
      "Overall Gain (Receiver Gain)",
      "Dynamic Range"
    ],
    "respuesta_correcta": [
      "Overall Gain (Receiver Gain)"
    ],
    "concept_to_study": "Gain Settings",
    "explicacion_openai": "Overall Gain (Receiver Gain) controls the amplification of the received echoes. If set too high, it can cause the image to appear excessively bright, leading to a loss of detail and saturation. Proper adjustment of gain settings is essential for optimizing image quality and ensuring accurate diagnostic information."
  },
  {
    "clasificacion": "Doppler Imaging Concepts",
    "grupo": "3-21",
    "tipo_pregunta": "opcion_multiple",
    "enunciado": "Which Doppler angle provides the most accurate velocity measurement?",
    "image": "",
    "opciones": [
      "0 degrees",
      "45 degrees",
      "60 degrees",
      "90 degrees"
    ],
    "respuesta_correcta": [
      "0 degrees"
    ],
    "concept_to_study": "Doppler Angle and Velocity Accuracy",
    "explicacion_openai": "The most accurate Doppler velocity measurements are obtained when the ultrasound beam is parallel to the direction of blood flow (Doppler angle of 0 degrees). The Doppler equation includes the cosine of the Doppler angle, and cos(0) = 1. Selecting the correct Doppler angle is crucial for accurate velocity measurements."
  },
  {
    "clasificacion": "Imaging Principles and Instrumentation",
    "grupo": "9-22",
    "tipo_pregunta": "opcion_multiple",
    "enunciado": "Reverberation artifacts are most likely to occur between:",
    "image": "",
    "opciones": [
      "Two weak reflectors",
      "Two strong reflectors",
      "A strong reflector and a weak reflector",
      "Two tissues with different acoustic impedances"
    ],
    "respuesta_correcta": [
      "Two strong reflectors"
    ],
    "concept_to_study": "Reverberation Artifact",
    "explicacion_openai": "Reverberation artifacts occur when sound bounces back and forth between two strong, parallel reflectors. This creates multiple, equally spaced echoes on the display, appearing deeper than the actual reflectors. Recognizing reverberation artifacts is essential for accurate image interpretation and diagnosis."
  },
  {
    "clasificacion": "Ultrasound Transducers",
    "grupo": "5-80",
    "tipo_pregunta": "opcion_multiple",
    "enunciado": "What is the primary advantage of using a 1.5D or multi-row array transducer?",
    "image": "",
    "opciones": [
      "Improved lateral resolution",
      "Improved elevational resolution",
      "Improved axial resolution",
      "Increased penetration depth"
    ],
    "respuesta_correcta": [
      "Improved elevational resolution"
    ],
    "concept_to_study": "1.5D Array Transducers",
    "explicacion_openai": "1.5D array transducers have multiple rows of elements in the elevational plane (slice thickness). This allows for electronic focusing in the elevational dimension, improving elevational resolution (slice thickness resolution). Understanding transducer technology is essential for optimizing image quality and resolution."
  },
  {
    "clasificacion": "Physical Principles",
    "grupo": "7-40",
    "tipo_pregunta": "opcion_multiple",
    "enunciado": "Which of the following tissues has the highest attenuation coefficient?",
    "image": "",
    "opciones": [
      "Fat",
      "Muscle",
      "Bone",
      "Water"
    ],
    "respuesta_correcta": [
      "Bone"
    ],
    "concept_to_study": "Attenuation Coefficient",
    "explicacion_openai": "Bone has the highest attenuation coefficient of the listed tissues. This means that ultrasound energy is absorbed, scattered, and reflected to a greater extent in bone compared to fat, muscle, or water. Knowledge of attenuation is crucial for interpreting ultrasound images and optimizing imaging techniques."
  },
  {
    "clasificacion": "Clinical Safety, Patient Care, and Quality Assurance",
    "grupo": "12-10",
    "tipo_pregunta": "opcion_multiple",
    "enunciado": "What is the primary purpose of informed consent in ultrasound examinations?",
    "image": "",
    "opciones": [
      "To protect the sonographer from legal liability",
      "To ensure the patient understands the procedure and its risks/benefits",
      "To obtain payment authorization from the patient's insurance",
      "To document the patient's medical history"
    ],
    "respuesta_correcta": [
      "To ensure the patient understands the procedure and its risks/benefits"
    ],
    "concept_to_study": "Informed Consent",
    "explicacion_openai": "The primary purpose of informed consent is to ensure that the patient has a clear understanding of the ultrasound procedure, including its purpose, potential benefits, risks, and alternatives. This allows the patient to make an autonomous decision about their care. Awareness of informed consent is essential for ethical and legal compliance in medical practice."
  },
  {
    "clasificacion": "Physical Principles",
    "grupo": "5-8-26",
    "tipo_pregunta": "opcion_multiple",
    "enunciado": "Imagine you are teaching a student. How would you describe the echotexture of the area exhibiting posterior enhancement *compared to* the surrounding tissue in THIS image?",
    "image": "enhacement.png",
    "opciones": [
      "It is relatively darker",
      "It is relatively brighter",
      "It has the same brightness",
      "It is impossible to compare"
    ],
    "respuesta_correcta": [
      "It is relatively brighter"
    ],
    "concept_to_study": "Posterior Acoustic Enhancement",
    "explicacion_openai": "Posterior acoustic enhancement, also known as through transmission, occurs when sound travels through a weakly attenuating structure (like a cyst). The area behind the structure appears brighter than surrounding tissues because the sound beam has experienced less attenuation. Recognizing this artifact is crucial for accurate image interpretation and diagnosis."
  },
  {
    "clasificacion": "Physical Principles",
    "grupo": "5-8-1",
    "tipo_pregunta": "opcion_multiple",
    "enunciado": "Examine the ultrasound image from a patient presenting with right upper quadrant pain, a condition commonly associated with gallbladder adenomyomatosis. Which ultrasound artifact is displayed in the image?",
    "image": "comet_tail.png",
    "opciones": [
      "Comet tail artifact",
      "Ring-down artifact",
      "Mirror image artifact",
      "Acoustic shadowing"
    ],
    "respuesta_correcta": [
      "Comet tail artifact"
    ],
    "concept_to_study": "Comet Tail Artifact",
    "explicacion_openai": "In this case, the presence of adenomyomatosis indicates a comet tail artifact, characterized by tapering, closely spaced lines due to highly reflective cholesterol crystals or calcifications in the gallbladder. Comet tail artifacts generally do not extend as far distally as ring-down artifacts. Ring-down artifacts, which appear as continuous, uniform bands, often extend further due to resonance effects from gas bubbles or fluid collections, as seen in conditions like emphysematous cholecystitis. Recognizing these features helps in accurately distinguishing between conditions involving solid versus gaseous elements."
  },
  {
    "clasificacion": "Physical Principles",
    "grupo": "5-9-8",
    "tipo_pregunta": "opcion_multiple",
    "enunciado": "Based on your observation of the image, how does the size of the shadowing object relate to the width of the shadow at its origin?",
    "image": "shadowing.png",
    "opciones": [
      "The shadow is wider than the object.",
      "The shadow is narrower than the object.",
      "The shadow is approximately the same width as the object.",
      "The size of the object and shadow are unrelated."
    ],
    "respuesta_correcta": [
      "The shadow is approximately the same width as the object."
    ],
    "concept_to_study": "Acoustic Shadowing",
    "explicacion_openai": "Acoustic shadowing occurs when sound encounters a highly attenuating or highly reflective structure. The shadow's width at its origin is typically approximately the same width as the object causing the shadowing. The shadow appears as a dark region posterior to the object. Recognizing shadowing is crucial for accurate image interpretation and diagnosis."
  },
  {
    "clasificacion": "Doppler Imaging Concepts",
    "grupo": "10-1",
    "tipo_pregunta": "opcion_multiple",
    "enunciado": "Which labeled transducers result in a positive Doppler shift?",
    "image": "doppler.png",
    "opciones": [
      "Transducer A and B",
      "Transducer B",
      "Transducer C and E",
      "Transducer A and C"
    ],
    "respuesta_correcta": [
      "Transducer A and C"
    ],
    "concept_to_study": "Doppler Shift",
    "explicacion_openai": "Imagine standing by the roadside as a car approaches, honking its horn. The horn sounds higher in pitch as it comes closer. This is an example of the Doppler effect: the sound frequency increases because the car is moving toward you. In ultrasound, a positive Doppler shift happens when blood flow moves toward the transducer, similar to the approaching car. This causes the reflected sound to have a higher frequency. Transducers detecting flow toward them will show a positive waveform, those detecting flow away will show a negative waveform, and those positioned perpendicularly will not detect any flow. This concept is crucial for doctors and technicians because it helps them visualize how and how fast blood is moving in the body. For example, detecting abnormal flow in a blood vessel might indicate a blockage or narrowing, which is important for diagnosis and treatment."
  },
  {
    "clasificacion": "Doppler Imaging Concepts",
    "grupo": "10-2",
    "tipo_pregunta": "opcion_multiple",
    "enunciado": "Which labeled transducers result in a negative Doppler shift?",
    "image": "doppler.png",
    "opciones": [
      "Transducer A",
      "Transducer B and D",
      "Transducer C and E",
      "Transducer D and A"
    ],
    "respuesta_correcta": [
      "Transducer B and D"
    ],
    "concept_to_study": "Doppler Shift",
    "explicacion_openai": "A negative Doppler shift occurs when the transducer detects flow away from it. Recognizing Doppler shifts is essential for accurately assessing blood flow direction and velocity in clinical practice."
  },
  {
    "clasificacion": "Doppler Imaging Concepts",
    "grupo": "8-8-8-8-1",
    "tipo_pregunta": "opcion_multiple",
    "enunciado": "A sonographer is evaluating blood flow within a vessel using pulsed-wave Doppler. The image displays four sample volumes (A, B, C, and D) placed in different locations within the vessel. Which sample volume is *MOST LIKELY* to provide an accurate representation of the maximum velocity (peak systole) in a non-stenotic vessel segment?",
    "image": "window2.jpg",
    "opciones": [
      "Sample A",
      "Sample B",
      "Sample C",
      "Sample D"
    ],
    "respuesta_correcta": [
      "Sample B"
    ],
    "concept_to_study": "Doppler Sample Volume Placement",
    "explicacion_openai": "Sample volume B, positioned centrally within the vessel, is most likely to accurately represent the peak systolic velocity in a non-stenotic segment. Proper sample volume placement is crucial for obtaining accurate Doppler measurements and assessing blood flow characteristics."
  },
  {
    "clasificacion": "Physical Principles",
    "grupo": "4-1-1-1-1",
    "tipo_pregunta": "opcion_multiple",
    "enunciado": "What type of resolution is demonstrated in the image if it is determined by the ability to distinguish structures along the ultrasound beam path?",
    "image": "axial.png",
    "opciones": [
      "Lateral",
      "Axial",
      "Temporal",
      "Contrast"
    ],
    "respuesta_correcta": [
      "Axial"
    ],
    "concept_to_study": "Resolution Types",
    "explicacion_openai": "Axial resolution refers to distinguishing structures that lie along the direction of the sound beam. Mastery of axial resolution is essential for achieving high-quality images and accurate diagnoses."
  },
  {
    "clasificacion": "Imaging Principles and Instrumentation",
    "grupo": "2-2-1-1-1",
    "tipo_pregunta": "opcion_multiple",
    "enunciado": "What is the relationship between pulse repetition frequency and pulse repetition period?",
    "image": "",
    "opciones": [
      "Directly proportional",
      "Inversely proportional",
      "Not related",
      "Exponentially related"
    ],
    "respuesta_correcta": [
      "Inversely proportional"
    ],
    "concept_to_study": "Pulse Repetition Frequency and Period",
    "explicacion_openai": "Pulse repetition frequency (PRF) and pulse repetition period (PRP) are inversely proportional. As PRF increases, PRP decreases, and vice versa. Understanding this relationship is crucial for optimizing ultrasound settings and image quality."
  },
  {
    "clasificacion": "Imaging Principles and Instrumentation",
    "grupo": "2-3-1-1-1",
    "tipo_pregunta": "opcion_multiple",
    "enunciado": "What happens to the duty factor if the pulse repetition period increases?",
    "image": "",
    "opciones": [
      "Increases",
      "Decreases",
      "Remains the same",
      "Becomes zero"
    ],
    "respuesta_correcta": [
      "Decreases"
    ],
    "concept_to_study": "Duty Factor",
    "explicacion_openai": "The duty factor decreases if the pulse repetition period (PRP) increases. The duty factor is the fraction of time that the ultrasound system is actively transmitting sound. Proper understanding of the duty factor is essential for optimizing ultrasound settings and ensuring patient safety."
  },
  {
    "clasificacion": "Imaging Principles and Instrumentation",
    "grupo": "2-4-1-1-1",
    "tipo_pregunta": "opcion_multiple",
    "enunciado": "What is the effect of increasing frequency on the pulse duration?",
    "image": "",
    "opciones": [
      "Increases pulse duration",
      "Decreases pulse duration",
      "No effect on pulse duration",
      "Doubles the pulse duration"
    ],
    "respuesta_correcta": [
      "Decreases pulse duration"
    ],
    "concept_to_study": "Frequency and Pulse Duration",
    "explicacion_openai": "Increasing the frequency decreases the pulse duration. Higher frequencies result in shorter wavelengths and shorter pulse durations. This relationship is crucial for optimizing image resolution and quality."
  },
  {
    "clasificacion": "Imaging Principles and Instrumentation",
    "grupo": "2-5-1-1-1",
    "tipo_pregunta": "opcion_multiple",
    "enunciado": "How does the spatial pulse length affect axial resolution?",
    "image": "",
    "opciones": [
      "Longer spatial pulse length improves resolution",
      "Shorter spatial pulse length improves resolution",
      "Spatial pulse length has no effect on resolution",
      "Spatial pulse length doubles resolution"
    ],
    "respuesta_correcta": [
      "Shorter spatial pulse length improves resolution"
    ],
    "concept_to_study": "Spatial Pulse Length and Axial Resolution",
    "explicacion_openai": "Shorter spatial pulse length improves axial resolution. Axial resolution is determined by the ability to distinguish structures along the direction of the sound beam. Mastery of this relationship is essential for achieving high-quality images and accurate diagnoses."
  },
   {
    "clasificacion": "Clinical Safety, Patient Care, and Quality Assurance",
    "grupo": "980",
    "tipo_pregunta": "opcion_multiple",
    "enunciado": "What does letter D in the phantom image represent?",
    "image": "phantom.png",
    "opciones": [
      "Dead zone assessment",
      "Spatial resolution testing",
      "Slice thickness and elevational resolution",
      "Grey scale accuracy"
    ],
    "respuesta_correcta": [
      "Slice thickness and elevational resolution"
    ],
    "concept_to_study": "slice thickness, elevational resolution",
    "explicacion_openai": "Letter D represents slice thickness and elevational resolution assessment, utilizing cystic spaces of varying sizes and depths to check the system's ability to focus in the elevational plane."
  }
  ]
